## Электронная почта: mobynick365@gmail.com
## VK: https://vk.com/mobynick_kaktys
# [ Сценарий 1 — Регистрация ]
1.Пользователь на экране входа в аккаунт выбирает опцию «Создать аккаунт».
2.Пользователь придумывает себе логин и вводит его.
3.Пользователь придумывает пароль и вводит его 2 раза.
4.Пользователь выбирает язык, на котором создает ботов/фреймворк, который использует в своих веб-приложениях.
5.Пользователю даётся код для восстановления пароля.
6.Пользователь попадает на страницу своего профиля.
# [ Сценарий 2 — Восстановление пароля ]
1.Пользователь на экране входа в аккаунт выбирает опцию «Восстановить пароль».
2.Пользователь попадает на экран «Восстановления пароля».
3.Пользователь вводит свой логин.
4.Пользователь вводит свой специальный код для восстановления пароля.
5.Пользователь попадает на экран изменения пароля, где он 2 раза вводит новый пароль. После этого пароль меняется.
# [ Сценарий 3 — деплой бота ]
1.Пользователь заходит на страницу деплоя.
2.Пользователь выбирает вкладку "Боты" и выбирает фреймворк/библиотеку, на котором написан бот.
3.Пользователь заливает файл бота на сайт с помощью drag&drop или через git.
4.Пользователь выбирает способ запуска бота - Long Polling или WebHook.
5.Пользователь сохраняет настройки и запускает бота.
# [ Сценарий 4 — деплой веб-приложения ]
1.Пользователь заходит на страницу деплоя.
2.Пользователь выбирает вкладку "Web" и выбирает фреймворк/библиотеку, на котором написано веб-приложение.
3.Пользователь заливает проект на сайт с помощью git.
4.Пользователь выбирает окружение для своего веб-приложения(необходимые библиотеки и т.п.), либо указывает, что виртуальное окружение уже установлено.
5.Пользователь сохраняет настройки и запускает веб-приложение.
# [ Сценарий 5 — Конструктор ботов ]
1.Пользователь заходит на страницу «Конструктор».
2.Пользователь нажимает на кнопку «Создать бота».
3.Пользователь выбирает для каких платформ делать бота(ВК, телеграм).
4.Пользователь вводит название бота.
5.Пользователь "собирает" бота блоками, схожими с подобными в scratch.
6.Пользователь проверяет работу бота на эмуляторе.
7.Пользователь переходит к деплою созданного бота.
